{
  "architectures": [
    "XLMRobertaForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "B-CONTACT_INFO",
    "1": "B-DELIVERY_FEE",
    "2": "B-LOC",
    "3": "B-LOCATION",
    "4": "B-ORG",
    "5": "B-PER",
    "6": "B-PRICE",
    "7": "B-PRODUCT",
    "8": "B-TIME",
    "9": "B-TTL",
    "10": "I-DELIVERY_FEE",
    "11": "I-LOC",
    "12": "I-LOCATION",
    "13": "I-ORG",
    "14": "I-PER",
    "15": "I-PRICE",
    "16": "I-PRODUCT",
    "17": "I-TIME",
    "18": "I-TTL",
    "19": "O"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-CONTACT_INFO": 0,
    "B-DELIVERY_FEE": 1,
    "B-LOC": 2,
    "B-LOCATION": 3,
    "B-ORG": 4,
    "B-PER": 5,
    "B-PRICE": 6,
    "B-PRODUCT": 7,
    "B-TIME": 8,
    "B-TTL": 9,
    "I-DELIVERY_FEE": 10,
    "I-LOC": 11,
    "I-LOCATION": 12,
    "I-ORG": 13,
    "I-PER": 14,
    "I-PRICE": 15,
    "I-PRODUCT": 16,
    "I-TIME": 17,
    "I-TTL": 18,
    "O": 19
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "xlm-roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.52.4",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 250002
}
